In [11]:
import pandas as p

In [12]:
p.read_excel("Data1.xlsx")

     Name      Batch Address  RollNo
0  Adarsh  python-01   Noida       1
1    Diya  python-01   Delhi       2
2    Yash    Java-01   Delhi       3
3   Akash  python-02   Noida       5

In [13]:
p.read_csv("MyData.tsv",sep='\t')

     NAME GRADE  ROLLNO ADDRESS
0  Adarsh    A+       1   Delhi
1    Yash   A++       2   Noida
2    Diya     O       3   Assam

In [14]:
p.read_csv("Data2.csv")

     Name      Batch Address  RollNo
0  Adarsh  python-01   Noida       1
1    Diya  python-01   Delhi       2
2    Yash    Java-01   Delhi       3
3   Akash  python-02   Noida       5
4   Harsh  python-03   Delhi       4
5  Faizal    Java-02   Assam       7